𝓿 = 𝓉𝔂𝓹𝓮("m", (), {"__init__": lambda 𝔞, ｂ: 𝓈𝔢ｔ𝒶𝓽ｔ𝓻(𝒶, "b", 𝔟), "s": lambda 𝒶, ｂ: 𝔳(𝔟(𝔞.𝒷).𝓫)})
𝒸 = 𝔱𝓎𝓹𝓮("l", (), {"__init__": lambda 𝔞, 𝔟: 𝔰𝑒𝓽ａ𝓉𝓉𝔯(ａ, "b", 𝓫), "d": lambda ａ, 𝔟: 𝔞 if 𝓋(ａ.𝒷).ｓ(𝒷).𝔟 != ｂ(ａ.𝔟).𝓫 else ｂ(𝔞.𝔟)})
𝔪 = lambda 𝔵: 𝔠(f"{𝓵𝔦𝓈𝔱(𝓏𝔦𝔭([𝓁(𝔦 + 5*𝔦) for ｉ in 𝔁], [𝔩(𝔦 + 𝓲) for 𝔦 in 𝔵][::-1]))[::-1] = }")
𝔫 = lambda ｘ: 𝒸("{x[';]:=^450}".forｍ𝒶𝓽(𝔵={'''';''': 𝔵}))
𝔩 = lambda 𝔁: (12648430 ^ (𝔵 + 3735928559)) * 3862272608
𝓀 = 𝓲ｎ𝔭𝔲𝓽("Insert your flag: ")
𝓈 = [(lambda 𝔷, ｆ, ｘ, 𝔫: 𝓍 if 𝓷 == 0 else 𝔣(𝔷, 𝒻, (lambda 𝓶, 𝓃: (lambda 𝓍: 𝒾ｎ𝔱(𝔁[ｌ𝔢𝔫(𝔵)-59:], 2) + 𝒾𝓷𝓽(𝔵[:𝔩𝓮ｎ(𝔁)-59], 2) if 𝔩ｅ𝔫(𝔁)-59 > 0 else 𝔦ｎ𝓽(𝔵,2))(ｂ𝒾𝔫(𝓶 * 𝓷)))(𝔁, 𝔃), ｎ - 1))(𝔰𝔲𝓂((ｏ𝔯𝔡(𝔨[𝓲+𝒿]) << 𝒿*7) if ｉ+ｊ < ｌ𝔢𝔫(𝓴) else (127 << 𝒿*7) for 𝔧 in 𝓇𝔞ｎ𝑔𝔢(8)), (lambda 𝔷, 𝓯, ｘ, 𝔫: ｘ if 𝔫 == 0 else ｆ(𝔷, 𝓯, (lambda 𝔫, 𝔪: (lambda 𝔵: ｉｎ𝔱(ｘ[𝓁ｅ𝔫(𝓍)-59:], 2) + 𝓲ｎｔ(𝔁[:𝓁𝑒𝔫(𝔵)-59], 2) if 𝓵𝑒𝔫(𝓍)-59 > 0 else 𝒾ｎ𝓽(ｘ,2))(𝓫𝔦𝔫(𝓷 * 𝔪)))(𝔁, 𝔷), 𝔫 - 1)), 1, 420_69) for 𝔦 in 𝓇ａ𝓷𝑔ｅ(0, 𝓁𝔢𝓷(𝔨), 8)]
if 𝓬(ｓ).𝔡(𝔪).𝒹(𝔫).ｂ == "=𝓵𝔦𝓈𝔱(𝓏𝔦𝔭([𝓁(𝔦 + 5*𝔦) for ｉ in 𝔁], [𝔩(𝔦 + 𝓲) for 𝔦 in 𝔵][::-1]))[::-1] = [(13969439442922757926633137632, 3251133470245911671632840864), (6919844817045365871489845728, 3067821989026578174692487328), (11408842561461143227463443808, 3766356150094573135206359136), (11299068421490417286376379488, 3802947530149782083826679648), (9203465938188223031329433888, 2306614948612889330244181216), (9753400381846729757945770272, 4656479823873291748257812704)]==":
    𝔭𝓻ｉ𝓷ｔ("Good flag!")
else:
    𝓹ｒ𝔦𝔫𝔱("Wrong flag!")